disks/iodepth/3_8.log
read4k-rand: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
read64k-seq: (g=1): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
write4k-rand: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
write4k-seq: (g=3): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
fio-3.7
Starting 4 processes

read4k-rand: (groupid=0, jobs=1): err= 0: pid=233583: Tue Aug 11 22:26:15 2020
   read: IOPS=475, BW=1902KiB/s (1947kB/s)(55.8MiB/30035msec)
    slat (usec): min=5, max=205, avg=41.43, stdev= 3.90
    clat (usec): min=1087, max=209489, avg=16774.34, stdev=17310.89
     lat (usec): min=1130, max=209530, avg=16816.75, stdev=17310.89
    clat percentiles (usec):
     |  1.00th=[  1696],  5.00th=[  2638], 10.00th=[  3425], 20.00th=[  5014],
     | 30.00th=[  6587], 40.00th=[  8225], 50.00th=[ 10159], 60.00th=[ 13960],
     | 70.00th=[ 18220], 80.00th=[ 25560], 90.00th=[ 38011], 95.00th=[ 52167],
     | 99.00th=[ 84411], 99.50th=[ 95945], 99.90th=[126354], 99.95th=[139461],
     | 99.99th=[183501]
   bw (  KiB/s): min= 1245, max= 1924, per=73.80%, avg=1402.95, stdev=83.27, samples=59
   iops        : min=  311, max=  481, avg=350.36, stdev=20.85, samples=59
  lat (msec)   : 2=1.98%, 4=11.81%, 10=35.39%, 20=23.73%, 50=21.50%
  lat (msec)   : 100=5.18%, 250=0.42%
  cpu          : usr=0.71%, sys=2.36%, ctx=14280, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14279,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
read64k-seq: (groupid=1, jobs=1): err= 0: pid=233584: Tue Aug 11 22:26:15 2020
   read: IOPS=3425, BW=214MiB/s (224MB/s)(5120MiB/23917msec)
    slat (usec): min=3, max=176, avg=16.06, stdev= 5.32
    clat (usec): min=49, max=44441, avg=2317.47, stdev=725.03
     lat (usec): min=66, max=44457, avg=2333.76, stdev=726.42
    clat percentiles (usec):
     |  1.00th=[  110],  5.00th=[ 2008], 10.00th=[ 2147], 20.00th=[ 2212],
     | 30.00th=[ 2278], 40.00th=[ 2278], 50.00th=[ 2311], 60.00th=[ 2376],
     | 70.00th=[ 2474], 80.00th=[ 2638], 90.00th=[ 2704], 95.00th=[ 2835],
     | 99.00th=[ 2966], 99.50th=[ 4490], 99.90th=[ 4621], 99.95th=[ 4752],
     | 99.99th=[12518]
   bw (  KiB/s): min=153187, max=193638, per=76.97%, avg=168725.02, stdev=6881.97, samples=47
   iops        : min= 2393, max= 3025, avg=2635.83, stdev=107.52, samples=47
  lat (usec)   : 50=0.01%, 100=0.10%, 250=4.87%
  lat (msec)   : 2=0.01%, 4=94.20%, 10=0.78%, 20=0.03%, 50=0.01%
  cpu          : usr=1.73%, sys=6.29%, ctx=79592, majf=0, minf=140
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=81920,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
write4k-rand: (groupid=2, jobs=1): err= 0: pid=233585: Tue Aug 11 22:26:15 2020
  write: IOPS=1177, BW=4712KiB/s (4825kB/s)(138MiB/30007msec)
    slat (usec): min=2, max=240, avg=31.48, stdev=20.05
    clat (usec): min=61, max=48815, avg=6753.53, stdev=5157.26
     lat (usec): min=81, max=48829, avg=6785.58, stdev=5167.76
    clat percentiles (usec):
     |  1.00th=[  119],  5.00th=[  129], 10.00th=[  137], 20.00th=[  163],
     | 30.00th=[ 4047], 40.00th=[ 6325], 50.00th=[ 7439], 60.00th=[ 8455],
     | 70.00th=[ 9372], 80.00th=[10421], 90.00th=[12518], 95.00th=[15664],
     | 99.00th=[19792], 99.50th=[21627], 99.90th=[26870], 99.95th=[32375],
     | 99.99th=[47973]
   bw (  KiB/s): min= 2148, max=60804, per=73.80%, avg=3476.66, stdev=7593.86, samples=59
   iops        : min=  537, max=15201, avg=868.71, stdev=1898.53, samples=59
  lat (usec)   : 100=0.15%, 250=28.10%, 500=0.22%
  lat (msec)   : 2=0.06%, 4=1.39%, 10=46.41%, 20=22.75%, 50=0.91%
  cpu          : usr=1.46%, sys=4.35%, ctx=25579, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,35348,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
write4k-seq: (groupid=3, jobs=1): err= 0: pid=233588: Tue Aug 11 22:26:15 2020
  write: IOPS=2333, BW=146MiB/s (153MB/s)(4375MiB/30003msec)
    slat (usec): min=4, max=364, avg=23.00, stdev=12.08
    clat (usec): min=161, max=57673, avg=3402.88, stdev=3060.40
     lat (usec): min=179, max=57730, avg=3426.20, stdev=3068.26
    clat percentiles (usec):
     |  1.00th=[ 2073],  5.00th=[ 2147], 10.00th=[ 2180], 20.00th=[ 2245],
     | 30.00th=[ 2278], 40.00th=[ 2311], 50.00th=[ 2343], 60.00th=[ 2474],
     | 70.00th=[ 2671], 80.00th=[ 2769], 90.00th=[ 7635], 95.00th=[10683],
     | 99.00th=[16909], 99.50th=[19006], 99.90th=[24511], 99.95th=[27132],
     | 99.99th=[50070]
   bw (  KiB/s): min=36224, max=217344, per=100.00%, avg=149323.42, stdev=76978.30, samples=60
   iops        : min=  566, max= 3396, avg=2333.20, stdev=1202.83, samples=60
  lat (usec)   : 250=0.12%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.37%, 4=87.46%, 10=5.68%, 20=5.98%, 50=0.33%
  lat (msec)   : 100=0.01%
  cpu          : usr=2.41%, sys=5.33%, ctx=69882, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,70004,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1902KiB/s (1947kB/s), 1902KiB/s-1902KiB/s (1947kB/s-1947kB/s), io=55.8MiB (58.5MB), run=30035-30035msec

Run status group 1 (all jobs):
   READ: bw=214MiB/s (224MB/s), 214MiB/s-214MiB/s (224MB/s-224MB/s), io=5120MiB (5369MB), run=23917-23917msec

Run status group 2 (all jobs):
  WRITE: bw=4712KiB/s (4825kB/s), 4712KiB/s-4712KiB/s (4825kB/s-4825kB/s), io=138MiB (145MB), run=30007-30007msec

Run status group 3 (all jobs):
  WRITE: bw=146MiB/s (153MB/s), 146MiB/s-146MiB/s (153MB/s-153MB/s), io=4375MiB (4588MB), run=30003-30003msec

Disk stats (read/write):
  sdd: ios=96199/105038, merge=0/118, ticks=429172/474214, in_queue=821555, util=72.13%